MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC1263ND4AE/mcu.h
/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M0 Processor and Core Peripherals */
#define __MPU_PRESENT           0       /*!< armikcmu does not provide a MPU present or not       */
#define __NVIC_PRIO_BITS        2       /*!< armikcmu Supports 2 Bits for the Priority Levels     */
#define __Vendor_SysTickConfig  0       /*!< Set to 1 if different SysTick Config is used         */
#define __FPU_PRESENT           0
#define __SOFTFP__ // Note: Added for MikroE implementation.
#ifndef __SOFTFP__
# define __SOFTFP__             1
#endif

#include "core_cm23.h"                   /*!< Cortex-M23 processor and core peripherals           */
// Note: Changed for MikroE implementation.
//#include "system_NUC1263.h"              /*!< NUC1263 System                                      */
#define __I volatile // Note: Added for MikroE implementation.
#define __O __I // Note: Added for MikroE implementation.
#define __IO __I // Note: Added for MikroE implementation.
#include <stdint.h>


#if defined ( __CC_ARM   )
#pragma anon_unions
#endif


/**
 * Initialize the system clock
 *
 * @param  None
 * @return None
 *
 * @brief  Setup the microcontroller system
 *         Initialize the PLL and update the SystemFrequency variable
 */
extern void SystemInit(void);



/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/

// Note: Changed for MikroE implementation.
//#include "fmc_reg.h"
// Note: Changed for MikroE implementation.
//#include "i2c_reg.h"
// Note: Changed for MikroE implementation.
//#include "acmp_reg.h"
// Note: Changed for MikroE implementation.
//#include "clk_reg.h"
// Note: Changed for MikroE implementation.
//#include "gpio_reg.h"
// Note: Changed for MikroE implementation.
//#include "sys_reg.h"
// Note: Changed for MikroE implementation.
//#include "uart_reg.h"
// Note: Changed for MikroE implementation.
//#include "llsi_reg.h"
// Note: Changed for MikroE implementation.
//#include "spi_reg.h"
// Note: Changed for MikroE implementation.
//#include "usbd_reg.h"
// Note: Changed for MikroE implementation.
//#include "adc_reg.h"
// Note: Changed for MikroE implementation.
//#include "bpwm_reg.h"
// Note: Changed for MikroE implementation.
//#include "dac_reg.h"
// Note: Changed for MikroE implementation.
//#include "pdma_reg.h"
// Note: Changed for MikroE implementation.
//#include "timer_reg.h"
// Note: Changed for MikroE implementation.
//#include "wdt_reg.h"
// Note: Changed for MikroE implementation.
//#include "wwdt_reg.h"
// Note: Changed for MikroE implementation.
//#include "crc_reg.h"
// Note: Changed for MikroE implementation.
//#include "i3cs_reg.h"
// Note: Changed for MikroE implementation.
//#include "spdh_reg.h"


/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/** @addtogroup PERIPHERAL_BASE Peripheral Memory Base
  Memory Mapped Structure for Series Peripheral
  @{
 */
/* Peripheral and SRAM base address */
#define FLASH_BASE          ((     uint32_t)0x00000000)
#define SRAM_BASE           ((     uint32_t)0x20000000)
#define AHB_BASE            ((     uint32_t)0x50000000)
#define APB1_BASE           ((     uint32_t)0x40000000)
#define APB2_BASE           ((     uint32_t)0x40100000)

/* Peripheral memory map */
#define GPIO_BASE           (AHB_BASE       + 0x4000)                   /*!< GPIO Base Address                                   */
#define PA_BASE             (GPIO_BASE              )                   /*!< GPIO PA Base Address                                */
#define PB_BASE             (GPIO_BASE      + 0x0040)                   /*!< GPIO PB Base Address                                */
#define PC_BASE             (GPIO_BASE      + 0x0080)                   /*!< GPIO PC Base Address                                */
#define PD_BASE             (GPIO_BASE      + 0x00C0)                   /*!< GPIO PD Base Address                                */
#define PF_BASE             (GPIO_BASE      + 0x0140)                   /*!< GPIO PF Base Address                                */
#define GPIO_DBCTL_BASE     (GPIO_BASE      + 0x0180)                   /*!< GPIO De-bounce Cycle Control Base Address           */
#define GPIO_PIN_DATA_BASE  (GPIO_BASE      + 0x0200)                   /*!< GPIO Pin Data Input/Output Control Base Address     */

#define UART0_BASE          (APB1_BASE      + 0x50000)                  /*!< UART0 Base Address                               */
#define UART1_BASE          (APB2_BASE      + 0x50000)                  /*!< UART1 Base Address                               */
#define UART2_BASE          (APB1_BASE      + 0x80000)                  /*!< UART2 Base Address                               */

#define TIMER0_BASE         (APB1_BASE      + 0x10000)                  /*!< Timer0 Base Address                              */
#define TIMER1_BASE         (APB1_BASE      + 0x10020)                  /*!< Timer1 Base Address                              */
#define TIMER2_BASE         (APB2_BASE      + 0x10000)                  /*!< Timer2 Base Address                              */
#define TIMER3_BASE         (APB2_BASE      + 0x10020)                  /*!< Timer3 Base Address                              */

#define WDT_BASE            (APB1_BASE      + 0x4000)                   /*!< Watch Dog Timer Base Address                     */

#define WWDT_BASE           (APB1_BASE      + 0x4100)                   /*!< Window Watch Dog Timer Base Address              */

